export const classTimetable2026 = {
    "1-1": {
        "월": ["국사", "영어", "과학", "과학", "수학", "체육", "사회"],
        "화": ["국사", "수학", "국어", "사회", "과1", "국2", ""],
        "수": ["국사", "영어", "수학", "진로", "사회", "미술", "미술"],
        "목": ["정보", "정보", "정보", "수학", "영어", "기관", "기관"],
        "금": ["미술", "체육", "국어", "자율", "자율", "창체", "창체"]
    },
    "1-2": {
        "월": ["국사", "국어", "기관", "기관", "체육", "수학", "영어"],
        "화": ["사회", "과학", "과1", "국2", "국사", "수학", ""],
        "수": ["수학", "사회", "미술", "미술", "과학", "국어", "영어"],
        "목": ["수학", "진로", "체육", "사회", "미술", "영어", "국사"],
        "금": ["정보", "정보", "정보", "자율", "자율", "창체", "창체"]
    },
    "1-3": {
        "월": ["정보", "정보", "정보", "영어", "진로", "미술", "미술"],
        "화": ["과학", "국사", "체육", "국어", "수학", "사회", ""],
        "수": ["영어", "과1", "국2", "사회", "수학", "체육", "과학"],
        "목": ["수학", "국어", "국사", "미술", "기관", "기관", "사회"],
        "금": ["영어", "수학", "국사", "자율", "자율", "창체", "창체"]
    },
    "1-4": {
        "월": ["기관", "기관", "사회", "국2", "수학", "국사", "과학"],
        "화": ["국어", "영어", "수학", "진로", "미술", "미술", ""],
        "수": ["과1", "국사", "체육", "영어", "사회", "과학", "수학"],
        "목": ["미술", "영어", "국사", "국어", "수학", "체육", "사회"],
        "금": ["정보", "정보", "정보", "자율", "자율", "창체", "창체"]
    },
    "1-5": {
        "월": ["영어", "국사", "미술", "미술", "국2", "사회", "수학"],
        "화": ["정보", "정보", "정보", "수학", "진로", "과1", ""],
        "수": ["수학", "국어", "기관", "기관", "체육", "영어", "사회"],
        "목": ["체육", "과학", "영어", "국사", "수학", "사회", "미술"],
        "금": ["국어", "국사", "과학", "자율", "자율", "창체", "창체"]
    },
    "1-6": {
        "월": ["수학", "체육", "국사", "국어", "영어", "과학", "사회"],
        "화": ["국사", "미술", "미술", "과1", "수학", "영어", ""],
        "수": ["국2", "수학", "진로", "체육", "국어", "사회", "국사"],
        "목": ["정보", "정보", "정보", "영어", "과학", "사회", "수학"],
        "금": ["기관", "기관", "미술", "자율", "자율", "창체", "창체"]
    },
    "1-7": {
        "월": ["과학", "사회", "체육", "수학", "국어", "영어", "국사"],
        "화": ["영어", "정보", "정보", "정보", "사회", "수학", ""],
        "수": ["국어", "수학", "영어", "과1", "국사", "프로", "프로"],
        "목": ["수학", "체육", "과학", "국사", "프로", "프로", "프로"],
        "금": ["사회", "국1", "진로", "자율", "자율", "창체", "창체"]
    },
    "1-8": {
        "월": ["정보", "정보", "정보", "수학", "사회", "진로", "국어"],
        "화": ["디일", "디일", "디일", "국사", "국1", "수학", ""],
        "수": ["국사", "체육", "과1", "수학", "영어", "디일", "디일"],
        "목": ["영어", "사회", "수학", "과학", "체육", "국사", "국어"],
        "금": ["과학", "영어", "사회", "자율", "자율", "창체", "창체"]
    },
    "2-1": {
        "월": ["대수", "섀정", "문학", "운동", "진로", "영어", "도장"],
        "화": ["엔정", "전정", "음악", "문학", "회로", "회로", ""],
        "수": ["영어", "운동", "전차", "대수", "차정", "음악", "문1"],
        "목": ["도장", "전정", "전차", "전차", "차정", "섀정", "엔정"],
        "금": ["음악", "영어", "대수", "자율", "자율", "창체", "창체"]
    },
    "2-2": {
        "월": ["문1", "영어", "대수", "음악", "섀정", "진로", "차정"],
        "화": ["영어", "엔정", "문학", "음악", "회로", "회로", ""],
        "수": ["음악", "문학", "운동", "대수", "전정", "영어", "도장"],
        "목": ["전차", "전차", "전정", "차정", "도장", "엔정", "섀정"],
        "금": ["전차", "운동", "대수", "자율", "자율", "창체", "창체"]
    },
    "2-3": {
        "월": ["영어", "문학", "도장", "도장", "대수", "전정", "전정"],
        "화": ["섀정", "섀정", "엔정", "엔정", "섀시", "섀시", ""],
        "수": ["문학", "영어", "차정", "차정", "전차", "전차", "전기"],
        "목": ["문1", "운동", "대수", "진로", "영어", "음악", "음악"],
        "금": ["운동", "대수", "음악", "자율", "자율", "창체", "창체"]
    },
    "2-4": {
        "월": ["대수", "음악", "전정", "전정", "영어", "운동", "문1"],
        "화": ["전차", "전차", "전기", "운동", "섀시", "섀시", ""],
        "수": ["차정", "차정", "대수", "영어", "음악", "엔정", "엔정"],
        "목": ["진로", "음악", "대수", "영어", "문학", "도장", "도장"],
        "금": ["섀정", "섀정", "문학", "자율", "자율", "창체", "창체"]
    },
    "2-5": {
        "월": ["영어", "전차", "전차", "전기", "문학", "음악", "대수"],
        "화": ["차정", "차정", "전정", "전정", "섀시", "섀시", ""],
        "수": ["섀정", "섀정", "음악", "영어", "도장", "도장", "대수"],
        "목": ["운동", "문학", "음악", "문1", "대수", "진로", "영어"],
        "금": ["엔정", "엔정", "운동", "자율", "자율", "창체", "창체"]
    },
    "2-6": {
        "월": ["응1", "응1", "대수", "중국", "커1", "커1", "운동"],
        "화": ["데프", "데프", "운동", "대수", "영어", "문학", ""],
        "수": ["커넥", "커넥", "중국", "문학", "응개", "응개", "응개"],
        "목": ["응1", "응1", "영어", "진로", "대수", "중국", "문1"],
        "금": ["영어", "데프", "데프", "자율", "자율", "창체", "창체"]
    },
    "2-7": {
        "월": ["운동", "영어", "데프", "데프", "중국", "문학", "대수"],
        "화": ["응1", "응1", "응1", "응1", "커넥", "커넥", ""],
        "수": ["대수", "중국", "데프", "데프", "운동", "문1", "영어"],
        "목": ["문학", "영어", "응개", "응개", "응개", "커넥", "커넥"],
        "금": ["진로", "중국", "대수", "자율", "자율", "창체", "창체"]
    },
    "2-8": {
        "월": ["중국", "운동", "튜1", "튜1", "영어", "대수", "진로"],
        "화": ["자실", "자실", "컴그", "컴그", "중국", "영어", ""],
        "수": ["대수", "영어", "튜닝", "튜닝", "문학", "운동", "중국"],
        "목": ["컴그", "컴그", "튜닝", "튜닝", "문1", "실무", "실무"],
        "금": ["문학", "대수", "컴그", "자율", "자율", "창체", "창체"]
    },
    "3-1": {
        "월": ["전정", "전정", "섀정", "섀정", "도장", "도장", "실영"],
        "화": ["도장", "도장", "전차", "전차", "엔진", "엔진", ""],
        "수": ["전정", "전정", "섀정", "섀정", "주행", "차정", "차정"],
        "목": ["진로", "실영", "성공", "성공", "운동", "차정", "차정"],
        "금": ["주행", "전차", "엔진", "엔진", "자율", "창체", "창체"]
    },
    "3-2": {
        "월": ["차정", "차정", "성공", "성공", "엔진", "엔진", "전차"],
        "화": ["섀정", "섀정", "차정", "차정", "전정", "전정", ""],
        "수": ["전차", "전차", "도장", "도장", "엔진", "엔진", "주행"],
        "목": ["도장", "도장", "진로", "운동", "실영", "실영", "주행"],
        "금": ["전정", "전정", "섀정", "섀정", "자율", "창체", "창체"]
    },
    "3-3": {
        "월": ["도실", "도실", "엔진", "엔진", "차정", "차정", "진로"],
        "화": ["실영", "운동", "섀정", "섀정", "주행", "주행", ""],
        "수": ["엔정", "엔정", "전장", "전장", "전기", "섀시", "섀시"],
        "목": ["차체", "차체", "도장", "도장", "전차", "전차", "실영"],
        "금": ["성공", "성공", "전정", "전정", "자율", "창체", "창체"]
    },
    "3-4": {
        "월": ["엔정", "엔정", "차정", "차정", "실영", "섀정", "섀정"],
        "화": ["전장", "전장", "전정", "전정", "도장", "도장", ""],
        "수": ["도실", "도실", "엔진", "엔진", "진로", "성공", "성공"],
        "목": ["전차", "전차", "차체", "차체", "섀시", "섀시", "운동"],
        "금": ["전기", "실영", "주행", "주행", "자율", "창체", "창체"]
    },
    "3-5": {
        "월": ["응개", "응개", "성공", "성공", "주행", "주행", "실영"],
        "화": ["커넥", "커넥", "커넥", "커넥", "운동", "진로", ""],
        "수": ["전기", "전기", "응개", "응개", "주행", "응1", "응1"],
        "목": ["엔진", "엔진", "엔정", "엔정", "실영", "전차", "전차"],
        "금": ["도실", "도실", "도장", "도장", "자율", "창체", "창체"]
    },
    "3-6": {
        "월": ["커1", "커1", "전차", "전차", "주행", "응1", "응1"],
        "화": ["응개", "응개", "진로", "운동", "주행", "주행", ""],
        "수": ["성공", "성공", "커넥", "커넥", "실영", "전기", "전기"],
        "목": ["섀시", "섀시", "섀정", "섀정", "응개", "응개", "실영"],
        "금": ["차정", "차정", "차체", "차체", "자율", "창체", "창체"]
    },
    "3-7": {
        "월": ["주행", "주행", "응개", "응개", "응화", "응화", "응화"],
        "화": ["성공", "성공", "진로", "실영", "자인", "자인", ""],
        "수": ["응1", "응1", "응1", "자인", "자인", "화1", "화1"],
        "목": ["커넥", "커넥", "화1", "화1", "응1", "응1", "응1"],
        "금": ["커넥", "커넥", "실영", "운동", "자율", "창체", "창체"]
    },
    "3-8": {
        "월": ["제디", "제디", "제디", "시디", "시디", "성공", "성공"],
        "화": ["튜닝", "튜닝", "실영", "진로", "시디", "시디", ""],
        "수": ["시디", "시디", "시디", "제디", "제디", "튜1", "튜1"],
        "목": ["튜닝", "튜닝", "제디", "제디", "제디", "튜2", "튜2"],
        "금": ["튜2", "튜1", "운동", "실영", "자율", "창체", "창체"]
    }
};
